<template>
  <div class="wrap-cont4 wrap-cont4-1 div-proj-header">
    <div class="container">
      <div class="div-logo">
        <div class="div-img">
          <a href="/">
            <img class="invert-img-white" draggable="false" src="../src/assets/images/footer-text-logo.svg"  alt="">
          </a>
        </div>
        <div class="div-desc">
          Более 100 объектов <br>
          сдали под ключ
        </div>
      </div>
      <div class="float-container float-container2 float-cont3">
        <div @click="changeTheme()" class="float-theme" :class="{'dark-mode': this.themeStorage}">
          <div class="dot"></div>
        </div>
      </div>
    </div>
  </div>
  <div class="wrap-cont-pricave">
    <div class="container container-privace">
      <h2>Политика обработки персональных данных</h2>
      <ol>
        <li>
          Общие положения
          <ol>
            <li><mark>&nbsp;ООО &laquo;Альпина&raquo; </mark>(далее по&nbsp;тексту&nbsp;&mdash; Оператор) ставит соблюдение прав и&nbsp;свобод граждан одним из&nbsp;важнейших условий осуществления своей деятельности.</li>
            <li>Политика Оператора в&nbsp;отношении обработки персональных данных (далее по&nbsp;тексту&nbsp;&mdash; Политика) применяется ко&nbsp;всей информации, которую Оператор может получить о&nbsp;посетителях веб-сайта <mark>кондиционеры-тверь.рф.</mark> Персональные данные обрабатывается в&nbsp;соответствии с&nbsp;ФЗ&nbsp;&laquo;О&nbsp;персональных данных&raquo; &#8470;&nbsp;152-ФЗ.</li>
          </ol>
        </li>
        <li>
          Основные понятия, используемые в&nbsp;Политике:
          <ol>
            <li>Веб-сайт&nbsp;&mdash; совокупность графических и&nbsp;информационных материалов, а&nbsp;также программ для ЭВМ и&nbsp;баз данных, обеспечивающих их&nbsp;доступность в&nbsp;сети интернет по&nbsp;сетевому адресу кондиционеры-тверь.рф;</li>
            <li>Пользователь&nbsp;&mdash; любой посетитель веб-сайта <mark>кондиционеры-тверь.рф</mark></li>
            <li>Персональные данные&nbsp;&mdash; любая информация, относящаяся к&nbsp;Пользователю веб-сайта <mark>кондиционеры-тверь.рф</mark></li>
            <li>Обработка персональных данных&nbsp;&mdash; любое действие с&nbsp;персональными данными, совершаемые с&nbsp;использованием ЭВМ, равно как и&nbsp;без их&nbsp;использования;</li>
            <li>Обезличивание персональных данных&nbsp;&mdash; действия, результатом которых является невозможность без использования дополнительной информации определить принадлежность персональных данных конкретному Пользователю или лицу;</li>
            <li>Распространение персональных данных&nbsp;&mdash; любые действия, результатом которых является раскрытие персональных данных неопределенному кругу лиц;</li>
            <li>Предоставление персональных данных&nbsp;&mdash; любые действия, результатом которых является раскрытие персональных данных определенному кругу лиц;</li>
            <li>Уничтожение персональных данных&nbsp;&mdash; любые действия, результатом которых является безвозвратное уничтожение персональных на&nbsp;ЭВМ или любых других носителях.</li>
          </ol>
        </li>
        <li>
          <mark>
            Оператор может обрабатывать следующие персональные данные:
            Проверьте, соответствует&nbsp;ли список ниже тем данным, которые собираете&nbsp;вы. Если нет, добавьте/удалите данные
            <ol>
              <li>
                Адрес электронной почты Пользователя
              </li>
              <li>
                Номер телефона Пользователя
              </li>
              <li>
                Фамилию, имя, отчество Пользователя
              </li>
              <li>
                Также на&nbsp;сайте происходит сбор и&nbsp;обработка обезличенных данных о&nbsp;посетителях (в&nbsp;т.ч. файлов &laquo;cookie&raquo;) с&nbsp;помощью сервисов интернет-статистики (Яндекс Метрика и&nbsp;Гугл Аналитика и&nbsp;других).
              </li>
            </ol>
          </mark>
        </li>
        <li>
          Цели обработки персональных данных
          <ol>
            <li>
              Цель обработки адреса электронной почты, номера телефона, фамилии, имени, отчества Пользователя&nbsp;&mdash; <mark>уточнение деталей заказа (проверьте, соответствует&nbsp;ли цель обработки персональных данных вашей, при необходимости замените на&nbsp;свою).</mark> Также Оператор имеет право направлять Пользователю уведомления о&nbsp;новых продуктах и&nbsp;услугах, специальных предложениях и&nbsp;различных событиях. Пользователь всегда может отказаться от&nbsp;получения информационных сообщений, направив Оператору письмо на&nbsp;адрес <a href="mailto:klimat-tver@yandex.ru"><mark>klimat-tver@yandex.ru</mark></a>
            </li>
            <li>
              Обезличенные данные Пользователей, собираемые с&nbsp;помощью сервисов интернет-статистики, служат для сбора информации о&nbsp;действиях Пользователей на&nbsp;сайте, улучшения качества сайта и&nbsp;его содержания.
            </li>
          </ol>
        </li>
        <li>
          Правовые основания обработки персональных данных
          <ol>
            <li>
              Оператор обрабатывает персональные данные Пользователя только в&nbsp;случае их&nbsp;отправки Пользователем через формы, расположенные на&nbsp;<mark>сайте кондиционеры-тверь.рф</mark>. Отправляя свои персональные данные Оператору, Пользователь выражает свое согласие с&nbsp;данной Политикой.
            </li>
            <li>
              Оператор обрабатывает обезличенные данные о&nbsp;Пользователе в&nbsp;случае, если это разрешено в&nbsp;настройках браузера Пользователя (включено сохранение файлов &laquo;cookie&raquo; и&nbsp;использование технологии JavaScript).
            </li>
          </ol>
        </li>
        <li>
          Порядок сбора, хранения, передачи и&nbsp;других видов обработки персональных данных
          <ol>
            <li>Оператор обеспечивает сохранность персональных данных и&nbsp;принимает все возможные меры, исключающие доступ к&nbsp;персональным данным неуполномоченных лиц.</li>
            <li>Персональные данные Пользователя никогда, ни&nbsp;при каких условиях не&nbsp;будут переданы третьим лицам, за&nbsp;исключением случаев, связанных с&nbsp;исполнением действующего законодательства.</li>
            <li>В&nbsp;случае выявления неточностей в&nbsp;персональных данных, Пользователь может актуализировать&nbsp;их, направив Оператору уведомление с&nbsp;помощью электронной почты на&nbsp;электронный адрес Оператора <a href="mailto:klimat-tver@yandex.ru"><mark>klimat-tver@yandex.ru </mark></a>, либо на&nbsp;почтовый адрес&nbsp;<address><mark>г. Тверь, пр-т Чайковского, д.28/2</mark></address>, с&nbsp;пометкой &laquo;Актуализация персональных данных&raquo;</li>
            <li>Срок обработки персональных данных является неограниченным. Пользователь может в&nbsp;любой момент отозвать свое согласие на&nbsp;обработку персональных данных, направив Оператору уведомление с&nbsp;помощью электронной почты на&nbsp;электронный адрес Оператора <a href="mailto:klimat-tver@yandex.ru"><mark>klimat-tver@yandex.ru</mark></a> , либо на&nbsp;почтовый адрес&nbsp;<address><mark>г. Тверь, пр-т Чайковского, д.28/2</mark></address>, с&nbsp;пометкой &laquo;Отзыв согласия на&nbsp;обработку персональных данных&raquo;.</li>
          </ol>
        </li>
        <li>
          Заключительные положения
          <ol>
            <li>Пользователь может получить любые разъяснения по&nbsp;интересующим вопросам, касающимся обработки его персональных данных, обратившись к&nbsp;Оператору с&nbsp;помощью электронной почты <a href="mailto:klimat-tver@yandex.ru"><mark>klimat-tver@yandex.ru</mark></a> , либо направив письмо на&nbsp;адрес <address><mark>( г. Тверь, пр-т Чайковского, д.28/2 )</mark></address> .</li>
            <li>В&nbsp;данном документе будут отражены любые изменения политики обработки персональных данных Оператором. В&nbsp;случае существенных изменений Пользователю может быть выслана информация на&nbsp;указанный им&nbsp;электронный адрес.</li>
          </ol>
        </li>
      </ol>
    </div>
  </div>
  <blockFooter class="toMainPage"></blockFooter>
</template>

<script>
import blockFooter from "./components/blockFooter"

export default {
  components:{
    "blockFooter": blockFooter,
  },
  data() {
    return {
      versionClass: localStorage.getItem('visuality'),
      themeStorage: false
    }
  },
  methods :{
    changeTheme(){
      if (localStorage.getItem('theme-window') !== "dark-theme"){
        localStorage.setItem('theme-window','dark-theme')
        document.querySelector('.float-theme').classList.toggle('dark-mode')
      } else {
        localStorage.setItem('theme-window','white-theme')
        document.querySelector('.float-theme').classList.toggle('dark-mode')
      }
      document.querySelector('html').setAttribute('theme', localStorage.getItem('theme-window'));
    },
  },
  mounted() {
    if (localStorage.getItem('theme-window') === "white-theme"){
      this.themeStorage = true;
    }
  }
}
</script>

<style scoped>

</style>